app/Controllers/Home.php

    public function index()
    {
        $userModel = new UserModel();
        $auth = service('authentication');
        $user = $userModel->find($auth->id());
        $username = ($user && is_object($user)) ? $user->username : '';

        $data['users'] = $username;

        echo view('layouts/templates/header', $data);
        echo view('home', $data); // pass the $data array to the view
        echo view('layouts/templates/footer');

        $user = $userModel->find($auth->id());
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '7'