app/Models/NosvinsModel.php

    public function getAll()
    {
        return $this->db->table('bottle')
        ->select(['full_name', 'label', 'volume','category_id', 'picture', 'current_price'])
        ->get()
        ->getResultArray();
---
SELECT `full_name`, `label`, `volume`, `category_id`, `picture`, `current_price`
FROM `bottle`

    public function ProductLookupById($id): array
    {
        return $this->db->table('bottle')
            ->select(['full_name', 'label', 'volume','category_id', 'picture', 'current_price'])
            ->get($id)
            ->getResultArray();
---
SELECT `full_name`, `label`, `volume`, `category_id`, `picture`, `current_price`
FROM `bottle`
 LIMIT 1